Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.GetUserProperty Method
Overload List
Name | Description
GetUserProperty(String, Double)
 Retrieves a double property for the ProjectInfo.
GetUserProperty(String, Int32)
 Retrieves an integer property for the ProjectInfo.
GetUserProperty(String, String)
 Retrieves a string property for the ProjectInfo.
Top
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace